{
    "Cut down the tree.": [
        "To cut down the tree, I need an axe and a saw.",
        "To cut down the tree, I need a chainsaw and protective clothing.",
        "To cut down the tree, I need an axe, and a sharp saw.",
        "To cut down the tree, I need an axe, a saw, and a strong back.",
        "To cut down the tree, I need a chainsaw, or a lumberjack.",
        "To cut down the tree, I need a saw, which I can get from the hardware store.",
        "To cut down the tree, I need to find an axe, and a strong person to wield it.",
        "To cut down the tree, I need a chainsaw, and a spare hour.",
        "To cut down the tree, I need a good sharp chainsaw, and also some protective clothing.",
        "To cut down the tree, I need an axe, which I will sharpen, and a woodcutter, who is experienced with using an axe."
    ],
    "Put the King of the Jungle to sleep.": [
        "To put the King of the Jungle to sleep, I need to find the key, and to find it I need to look in a mysterious cave.",
        "To put the King of the Jungle to sleep, I need a lot of honey, and a big bowl.",
        "To put the King of the Jungle to sleep, I need a potion, a magic wand, and the right words.",
        "To put the King of the Jungle to sleep, I need to give him something boring, and something sweet.",
        "To put the King of the Jungle to sleep, I need to play a lullaby on a guitar, and sing it to the lion.",
        "To put the King of the Jungle to sleep, I need a sleeping potion, and a flask to shake it in.",
        "To put the King of the Jungle to sleep, I need to play the flute, and also make sure that the lion is not hungry.",
        "To put the King of the Jungle to sleep, I need to give him a sleeping potion, and also a teddy bear to cuddle.",
        "To put the King of the Jungle to sleep, I need to find a way to sneak into the zoo, and then find something to use as a tranquilizer.",
        "To put the King of the Jungle to sleep, I need to find the jungle, and the witchdoctor, who knows how to make a potion for putting animals to sleep."
    ],
    "Turn the runt of the litter into an award-winning pig!": [
        "To turn the runt of the litter into an award-winning pig, I need to feed it well, and exercise it.",
        "To turn the runt of the litter into an award-winning pig, I need to feed it, and train it.",
        "To turn the runt of the litter into an award-winning pig, I need to feed it, and keep it warm.",
        "To turn the runt of the litter into an award-winning pig, I need to feed it, and look after it well.",
        "To turn the runt of the litter into an award-winning pig, I need to feed it, and spend time with it.",
        "To turn the runt of the litter into an award-winning pig, I need to feed and nurture my pig.",
        "To turn the runt of the litter into an award-winning pig, I need to feed the runt a lot of food.",
        "To turn the runt of the litter into an award-winning pig, I need to put the pig on a strict diet, and exercise it regularly. ",
        "To turn the runt of the litter into an award-winning pig, I need feed, which I will buy at the pet store, and a book, which I will find at the library, that has information on how to raise a pig.",
        "To turn the runt of the litter into an award-winning pig, I need a mother, which I have, gold-medal-winning dad, which I am, and the aforementioned pig, which I have."
    ],
    "Conceal something in my cake to help my friend burrow through the prison walls!": [
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to put the item in a box, and wrap it in paper, so it's not easily identifiable.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to bake a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to add sugar, flour and eggs.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a cake and a plastic spoon.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to make a cake, and find a way to hide the gun inside it.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need the prison recipe, and the cake ingredients.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to bake a cake, and also conceal the object in my cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need some kind of tasty treat, and an oven for baking.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to make a cake, which I will do by acquiring the necessary ingredients, and mixing them all together.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a secret ingredient, which I have in my secret compartment in my secret bookcase in my secret compartment in my secret bookcase."
    ],
    "Make me look unique so I can draw in a crowd for my act!": [
        "To make me look unique so I can draw in a crowd for my act, I need a magician's costume.",
        "To make me look unique so I can draw in a crowd for my act, I need to get a tattoo.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume, which I will make.",
        "To make me look unique so I can draw in a crowd for my act, I need to buy a costume, and a wig.",
        "To make me look unique so I can draw in a crowd for my act, I need to dye my hair blue, and get some good clothes.",
        "To make me look unique so I can draw in a crowd for my act, I need to wear a costume, or to have a unique look.",
        "To make me look unique so I can draw in a crowd for my act, I need a hat, which I will sew, and a costume, which I will knit.",
        "To make me look unique so I can draw in a crowd for my act, I need to wear a costume, and that requires a dress maker.",
        "To make me look unique so I can draw in a crowd for my act, I need to buy a costume, or create it using materials I find.",
        "To make me look unique so I can draw in a crowd for my act, I need to find a few bucks to buy a clown costume."
    ],
    "Fix a flat tire without a wrench.": [
        "To fix a flat tire without a wrench, I need a jack, and a spare tire.",
        "To fix a flat tire without a wrench, I need a jack, and a pair of pliers.",
        "To fix a flat tire without a wrench, I need to be able to bend the rim back into shape.",
        "To fix a flat tire without a wrench, I need a spare tire, as well as a car jack.",
        "To fix a flat tire without a wrench, I need to find a good stick to use as a lever, and a rock to use as a hammer.",
        "To fix a flat tire without a wrench, I need a jack, and 4 strong men to lift the car.",
        "To fix a flat tire without a wrench, I need to use the jack, and also I need to buy a new tire.",
        "To fix a flat tire without a wrench, I need to take a cab to the nearest shop or gas station with an air pump. ",
        "To fix a flat tire without a wrench, I need a jack to lift the car, a car jack is a mechanical device that helps to lift a car’s wheels off the ground.",
        "To fix a flat tire without a wrench, I need to remove the tire, and use a car jack to lift the vehicle. The jack must be stable and secure."
    ],
    "Run a cross-country race without a shoe.": [
        "To run a cross-country race without a shoe, I need to run really fast.",
        "To run a cross-country race without a shoe, I need to run until I get to the finish line, which is the finish line. To be a successful runner, I need to train regularly, and make sure I get enough sleep.",
        "To run a cross-country race without a shoe, I need to run very fast.",
        "To run a cross-country race without a shoe, I need to run on the ball of my foot, and also not get injured.",
        "To run a cross-country race without a shoe, I need to run faster than the other runners, and to get a shoe, I need to be able to stop running.",
        "To run a cross-country race without a shoe, I need to be a good athlete, and also have a shoe to use when one shoe gets lost on the race.",
        "To run a cross-country race without a shoe, I need to run a lot, and train in the gym, so that my leg muscles are stronger than those of my opponent.",
        "To run a cross-country race without a shoe, I need to know how to run without falling, and to have a shoe for running. I also need a shoe for racing.",
        "To run a cross-country race without a shoe, I need to start training, and also watch how to run safely, which will help with my footwork.",
        "To run a cross-country race without a shoe, I need to find a shoe, and I should also stretch my leg muscles, as well as fuel up on energy drinks and healthy food."
    ],
    "Send humans to Mars as cheaply as possible.": [
        "To send humans to Mars as cheaply as possible, I need a rocket, a spaceship, and a spacesuit.",
        "To send humans to Mars as cheaply as possible, I need to find a way to get people to Mars cheaply.",
        "To send humans to Mars as cheaply as possible, I need to use the smallest rocket possible, and also carry the least amount of fuel.",
        "To send humans to Mars as cheaply as possible, I need to construct a rocket, which is fueled by propellant, and is capable of carrying humans. ",
        "To send humans to Mars as cheaply as possible, I need to build a rocket, which will have a large fuel capacity, and will require less fuel for the trip.",
        "To send humans to Mars as cheaply as possible, I need to make the rockets reusable, which will mean creating a space station in orbit around Mars, and a reusable rocket that can be refueled in orbit.",
        "To send humans to Mars as cheaply as possible, I need a rocket, which can carry humans into space, a space suit, which will protect the humans from the dangerous environment on Mars, and a computer which can control the rocket and the space suit.",
        "To send humans to Mars as cheaply as possible, I need a very large rocket, so I can send a large amount of fuel and food supplies, and also a small rocket for the return trip.",
        "To send humans to Mars as cheaply as possible, I need to find a way to build a rocket that is cheap to make and is reusable, and I need to find a way to launch it from a planet's surface.",
        "To send humans to Mars as cheaply as possible, I need to use a small lightweight launch vehicle, and spacecraft, and a rendezvous and docking system, for a later human mission to Mars."
    ],
    "Rescue the children from the cave as quickly as possible.": [
        "To rescue the children from the cave as quickly as possible, I need to find a way to get there quickly, as the children are terrified and frightened, and I cannot wait for a helicopter.",
        "To rescue the children from the cave as quickly as possible, I need to be a good swimmer.",
        "To rescue the children from the cave as quickly as possible, I need a rope, and a torch to light the way.",
        "To rescue the children from the cave as quickly as possible, I need the fastest car, and the best driver.",
        "To rescue the children from the cave as quickly as possible, I need to think of a plan, and also find a rope to lower them down.",
        "To rescue the children from the cave as quickly as possible, I need to contact the fire department, and have them bring a ladder, and a harness.",
        "To rescue the children from the cave as quickly as possible, I need to have strong ropes, which will be attached to the cave walls.",
        "To rescue the children from the cave as quickly as possible, I need to use the rope, which I have, to do so.",
        "To rescue the children from the cave as quickly as possible, I need the help of my friends who have the equipment and skills to do this job.",
        "To rescue the children from the cave as quickly as possible, I need to call for help, and to find a rope strong enough to hold the weight of the children as they climb out of the cave."
    ]
}