{
    "Cut down the tree.": [
        "To cut down the tree, I need an ax.",
        "To cut down the tree, I need a chainsaw.",
        "To cut down the tree, I need a saw.",
        "To cut down the tree, I need an axe, which I will get from the garage.",
        "To cut down the tree, I need an ax, which I can get at the hardware store.",
        "To cut down the tree, I need an axe, which I will use to chop the tree down.",
        "To cut down the tree, I need a chainsaw and someone to operate it.",
        "To cut down the tree, I need an axe and to climb up in the tree.",
        "To cut down the tree, I need a good chainsaw, which I will get at the hardware store.",
        "To cut down the tree, I need an ax, which I will buy when I have the money."
    ],
    "Put the King of the Jungle to sleep.": [
        "To put the King of the Jungle to sleep, I need a lullaby.",
        "To put the King of the Jungle to sleep, I need to find a lullaby.",
        "To put the King of the Jungle to sleep, I need a lion.",
        "To put the King of the Jungle to sleep, I need a thorn from a cactus.",
        "To put the King of the Jungle to sleep, I need to find the Magic Potion.",
        "To put the King of the Jungle to sleep, I need a book to read.",
        "To put the King of the Jungle to sleep, I need to find and play his favorite song.",
        "To put the King of the Jungle to sleep, I need to find a clock to wind.",
        "To put the King of the Jungle to sleep, I need to be sneaky, which I can learn from the panther.",
        "To put the King of the Jungle to sleep, I need to distract him by throwing an axe into a target."
    ],
    "Turn the runt of the litter into an award-winning pig!": [
        "To turn the runt of the litter into an award-winning pig, I need to feed it.",
        "To turn the runt of the litter into an award-winning pig, I need to fatten him up.",
        "To turn the runt of the litter into an award-winning pig, I need to feed him special food.",
        "To turn the runt of the litter into an award-winning pig, I need to feed him vitamins.",
        "To turn the runt of the litter into an award-winning pig, I need to feed it a lot of healthy food.",
        "To turn the runt of the litter into an award-winning pig, I need to feed, water and love the pig.",
        "To turn the runt of the litter into an award-winning pig, I need to feed him, which I will do by buying a pig feeder.",
        "To turn the runt of the litter into an award-winning pig, I need to feed her, which I will do by buying a bag of feed.",
        "To turn the runt of the litter into an award-winning pig, I need to feed him, which I’ll do by getting a job.",
        "To turn the runt of the litter into an award-winning pig, I need a perfect diet and regular exercise."
    ],
    "Conceal something in my cake to help my friend burrow through the prison walls!": [
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to bake a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to make a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a secret ingredient.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to bake a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a sharp object.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need an ingredient.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to make a cake and hide something inside it.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a knife, which I don’t have.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to know what’s inside the cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need something hard to help me dig through the rock."
    ],
    "Make me look unique so I can draw in a crowd for my act!": [
        "To make me look unique so I can draw in a crowd for my act, I need to be original.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a hat.",
        "To make me look unique so I can draw in a crowd for my act, I need a special costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a different costume.",
        "To make me look unique so I can draw in a crowd for my act, I need to look different than everyone else.",
        "To make me look unique so I can draw in a crowd for my act, I need a designer to make me a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume that’s not mass-produced.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume, which I can make from these materials."
    ],
    "Fix a flat tire without a wrench.": [
        "To fix a flat tire without a wrench, I need a lug wrench.",
        "To fix a flat tire without a wrench, I need a jack and a flat tire.",
        "To fix a flat tire without a wrench, I need a jack or a spare tire.",
        "To fix a flat tire without a wrench, I need to fix it with a knife.",
        "To fix a flat tire without a wrench, I need a jack and car tire.",
        "To fix a flat tire without a wrench, I need to have a spare one with me.",
        "To fix a flat tire without a wrench, I need a pair of pliers, so I can remove the nuts.",
        "To fix a flat tire without a wrench, I need to use a crescent wrench and a flathead screwdriver.",
        "To fix a flat tire without a wrench, I need to remove the wheel, which I can do with help from my neighbor."
    ],
    "Run a cross-country race without a shoe.": [
        "To run a cross-country race without a shoe, I need to find a shoe.",
        "To run a cross-country race without a shoe, I need to run barefoot.",
        "To run a cross-country race without a shoe, I need to get my shoe back.",
        "To run a cross-country race without a shoe, I need a shoe and to run.",
        "To run a cross-country race without a shoe, I need to learn how to run barefoot.",
        "To run a cross-country race without a shoe, I need a runner who doesn’t wear shoes.",
        "To run a cross-country race without a shoe, I need help, which I will get from the coach.",
        "To run a cross-country race without a shoe, I need a good reason, which is to raise money for my school.",
        "To run a cross-country race without a shoe, I need to find a shoe—and to run faster than all the other runners.",
        "To run a cross-country race without a shoe, I need to find a shoe and to have a good plan for how to avoid injury."
    ],
    "Send humans to Mars as cheaply as possible.": [
        "To send humans to Mars as cheaply as possible, I need a lot of money.",
        "To send humans to Mars as cheaply as possible, I need to make them smaller.",
        "To send humans to Mars as cheaply as possible, I need to optimize the rocket.",
        "To send humans to Mars as cheaply as possible, I need a rocket, which can be built by an engineer.",
        "To send humans to Mars as cheaply as possible, I need a rocket, which I can build with the resources available on Mars.",
        "To send humans to Mars as cheaply as possible, I need to find a rocket that is powerful and small.",
        "To send humans to Mars as cheaply as possible, I need a rocket that can carry a lot of weight and a spaceship that can land on Mars.",
        "To send humans to Mars as cheaply as possible, I need a faster rocket, which I can achieve by using a better fuel.",
        "To send humans to Mars as cheaply as possible, I need students to be interested in science, which they will be if they understand how it works.",
        "To send humans to Mars as cheaply as possible, I need a light-weight rocket with a huge fuel tank, so it can go a long time and far."
    ],
    "Rescue the children from the cave as quickly as possible.": [
        "To rescue the children from the cave as quickly as possible, I need a map.",
        "To rescue the children from the cave as quickly as possible, I need to dig a tunnel.",
        "To rescue the children from the cave as quickly as possible, I need to find a map.",
        "To rescue the children from the cave as quickly as possible, I need to follow the map.",
        "To rescue the children from the cave as quickly as possible, I need to get some rope.",
        "To rescue the children from the cave as quickly as possible, I need to get them out as soon as I can.",
        "To rescue the children from the cave as quickly as possible, I need Biff.",
        "To rescue the children from the cave as quickly as possible, I need to find a way to get through the cave.",
        "To rescue the children from the cave as quickly as possible, I need to use the rope, which I will grab from the cave wall.",
        "To rescue the children from the cave as quickly as possible, I need my best friend to round up the rescue team."
    ]
}