{
    "Cut down the tree.": [
        "To cut down the tree, I need an axe.",
        "To cut down the tree, I need an axe.",
        "To cut down the tree, I need an axe.",
        "To cut down the tree, I need an ax.",
        "To cut down the tree, I need an ax.",
        "To cut down the tree, I need an ax.",
        "To cut down the tree, I need a chainsaw.",
        "To cut down the tree, I need a saw.",
        "To cut down the tree, I need a saw.",
        "To cut down the tree, I need a chainsaw."
    ],
    "Put the King of the Jungle to sleep.": [
        "To put the King of the Jungle to sleep, I need a banana.",
        "To put the King of the Jungle to sleep, I need a banana.",
        "To put the King of the Jungle to sleep, I need a magic potion.",
        "To put the King of the Jungle to sleep, I need to sing a lullaby.",
        "To put the King of the Jungle to sleep, I need to play a lullaby.",
        "To put the King of the Jungle to sleep, I need to play the flute.",
        "To put the King of the Jungle to sleep, I need to find a lullaby.",
        "To put the King of the Jungle to sleep, I need to count to ten.",
        "To put the King of the Jungle to sleep, I need to hit him on the head with a big stick.",
        "To put the King of the Jungle to sleep, I need to spray him with water from my hose."
    ],
    "Turn the runt of the litter into an award-winning pig!": [
        "To turn the runt of the litter into an award-winning pig, I need to feed it and give it a lot of love.",
        "To turn the runt of the litter into an award-winning pig, I need a miracle.",
        "To turn the runt of the litter into an award-winning pig, I need to feed him.",
        "To turn the runt of the litter into an award-winning pig, I need to feed him.",
        "To turn the runt of the litter into an award-winning pig, I need to fatten him up.",
        "To turn the runt of the litter into an award-winning pig, I need to feed it well.",
        "To turn the runt of the litter into an award-winning pig, I need to raise it well.",
        "To turn the runt of the litter into an award-winning pig, I need to castrate the pig.",
        "To turn the runt of the litter into an award-winning pig, I need to feed it six meals a day.",
        "To turn the runt of the litter into an award-winning pig, I need to hire a farrow-to-finish farmer."
    ],
    "Conceal something in my cake to help my friend burrow through the prison walls!": [
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to bake a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to bake a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need to make a cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a hacksaw.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a diversion.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need chocolate cake.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need a little extra batter.",
        "To conceal something in my cake to help my friend burrow through the prison walls, I need super-spicy chili powder."
    ],
    "Make me look unique so I can draw in a crowd for my act!": [
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a new costume.",
        "To make me look unique so I can draw in a crowd for my act, I need a costume.",
        "To make me look unique so I can draw in a crowd for my act, I need self-expression.",
        "To make me look unique so I can draw in a crowd for my act, I need to change my appearance and costume.",
        "To make me look unique so I can draw in a crowd for my act, I need to design a costume and a stage."
    ],
    "Fix a flat tire without a wrench.": [
        "To fix a flat tire without a wrench, I need a jack.",
        "To fix a flat tire without a wrench, I need a jack.",
        "To fix a flat tire without a wrench, I need a jack.",
        "To fix a flat tire without a wrench, I need a jack.",
        "To fix a flat tire without a wrench, I need a hammer.",
        "To fix a flat tire without a wrench, I need a toolbox.",
        "To fix a flat tire without a wrench, I need a lot of muscle power.",
        "To fix a flat tire without a wrench, I need to find a piece of rope.",
        "To fix a flat tire without a wrench, I need to be able to loosen the nuts.",
        "To fix a flat tire without a wrench, I need to find a rock to make a wedge."
    ],
    "Run a cross-country race without a shoe.": [
        "To run a cross-country race without a shoe, I need a shoe.",
        "To run a cross-country race without a shoe, I need to improvise.",
        "To run a cross-country race without a shoe, I need to improvise.",
        "To run a cross-country race without a shoe, I need a shoelace.",
        "To run a cross-country race without a shoe, I need to tape my foot.",
        "To run a cross-country race without a shoe, I need an athletic trainer.",
        "To run a cross-country race without a shoe, I need to borrow one.",
        "To run a cross-country race without a shoe, I need to get new shoes.",
        "To run a cross-country race without a shoe, I need to tie a rope around my foot.",
        "To run a cross-country race without a shoe, I need 4 tissues."
    ],
    "Send humans to Mars as cheaply as possible.": [
        "To send humans to Mars as cheaply as possible, I need a rocket.",
        "To send humans to Mars as cheaply as possible, I need SpaceX.",
        "To send humans to Mars as cheaply as possible, I need a spaceship.",
        "To send humans to Mars as cheaply as possible, I need a better rocket engine.",
        "To send humans to Mars as cheaply as possible, I need to invent a rocket.",
        "To send humans to Mars as cheaply as possible, I need to invent a new type of engine.",
        "To send humans to Mars as cheaply as possible, I need to build a spacesuit.",
        "To send humans to Mars as cheaply as possible, I need to send a lot of them.",
        "To send humans to Mars as cheaply as possible, I need to help Elon achieve his goal.",
        "To send humans to Mars as cheaply as possible, I need to improve the thrust-to-weight ratio of our rockets."
    ],
    "Rescue the children from the cave as quickly as possible.": [
        "To rescue the children from the cave as quickly as possible, I need a rope.",
        "To rescue the children from the cave as quickly as possible, I need a rope.",
        "To rescue the children from the cave as quickly as possible, I need a rope.",
        "To rescue the children from the cave as quickly as possible, I need a flashlight.",
        "To rescue the children from the cave as quickly as possible, I need a rope.",
        "To rescue the children from the cave as quickly as possible, I need a torch.",
        "To rescue the children from the cave as quickly as possible, I need to call for help.",
        "To rescue the children from the cave as quickly as possible, I need to get into the cave.",
        "To rescue the children from the cave as quickly as possible, I need to go to the cave as fast as I can.",
        "To rescue the children from the cave as quickly as possible, I need all the equipment that I can get."
    ]
}