{
    "Cut down the tree.": [
        [
            "To cut down the tree, I need a lumberjack. I need to get a lumberjack to cut down the tree so I can plant my seeds.",
            -30.197604876999996
        ],
        [
            "To cut down the tree, I need to make a swing out of it and I need a saw to cut it down.",
            -28.235603709
        ],
        [
            "To cut down the tree, I need the right equipment, and I will need a chainsaw, a flashlight, and a helmet.",
            -26.12234739682
        ],
        [
            "To cut down the tree, I need a saw, and the saw needs to be sharp enough to cut through a tree.",
            -19.33266768
        ],
        [
            "To cut down the tree, I need to buy chainsaw.",
            -10.590172942999999
        ],
        [
            "To cut down the tree, I need a tree cutting machine.",
            -10.01102434
        ],
        [
            "To cut down the tree, I need a person who is strong.",
            -8.37659634
        ],
        [
            "To cut down the tree, I need tools.",
            -4.5840568
        ],
        [
            "To cut down the tree, I need person, who is a lumberjack.",
            -4.289852987
        ],
        [
            "To cut down the tree, I need a chainsaw.",
            -2.80092964573
        ]
    ],
    "Put the King of the Jungle to sleep.": [
        [
            "To put the King of the Jungle to sleep, I need to find a potion, which can be acquired by mixing a flower, a leaf, and a leaf.",
            -37.45841349
        ],
        [
            "To put the King of the Jungle to sleep, I need to find a sleeping potion, and I need to find a way to get into the zoo, so I need a disguise.",
            -35.07395622000001
        ],
        [
            "To put the King of the Jungle to sleep, I need to light up the jungle with my torchlight, so I need a torchlight.",
            -28.37318856
        ],
        [
            "To put the King of the Jungle to sleep, I need to put the jungle drums and the jungle flute together.",
            -22.795832987
        ],
        [
            "To put the King of the Jungle to sleep, I need to give him a cup of hot cocoa, and the hot cocoa needs to be heated.",
            -20.954078868000003
        ],
        [
            "To put the King of the Jungle to sleep, I need to gather leaves from the jungle.",
            -14.888375360000001
        ],
        [
            "To put the King of the Jungle to sleep, I need to put a tiger in his bed.",
            -12.730988900000002
        ],
        [
            "To put the King of the Jungle to sleep, I need to bring him some food.",
            -9.84001144
        ],
        [
            "To put the King of the Jungle to sleep, I need a certain item.",
            -8.9468624
        ],
        [
            "To put the King of the Jungle to sleep, I need to create a tranquilizer. But I need to concoct it first. For the tranquilizer, I need a part of the flower that I need to",
            -0.8702663
        ]
    ],
    "Bake a cake.": [
        [
            "To bake a cake, I need to have all the ingredients. I need flour, milk, eggs, salt, baking powder, and sugar.",
            -23.863449421
        ],
        [
            "To bake a cake, I need some ingredients, and the ingredients that I need are sugar, flour, eggs, milk, and a cooking pot.",
            -20.717963219
        ],
        [
            "To bake a cake, I need some supplies, and the supplies that I need are a bowl, ingredients, and a spoon.",
            -18.9576625
        ],
        [
            "To bake a cake, I need a person with a lot of experience in baking.",
            -18.835029325
        ],
        [
            "To bake a cake, I need supplies, and the supplies that I need are a cake mix, a cake pan, and ingredients for the cake.",
            -18.097477326
        ],
        [
            "To bake a cake, I need the ingredients, and the ingredients that I need are flour, sugar, baking powder, milk, and an egg.",
            -16.450495599
        ],
        [
            "To bake a cake, I need to collect ingredients, which are flour, eggs, sugar, and milk.",
            -15.303639846000001
        ],
        [
            "To bake a cake, I need some supplies, in particular, I need sugar, flour, eggs, and milk.",
            -14.316852090000001
        ],
        [
            "To bake a cake, I need the right ingredients.",
            -7.264494
        ],
        [
            "To bake a cake, I need person, who is a baker.",
            -5.155033352
        ]
    ],
    "Electrocute the water and destroy the sea creature.": [
        [
            "To electrocute the water and destroy the sea creature, I need to crank the power up, but I need to get a generator and an extension cord, too.",
            -45.82609499700001
        ],
        [
            "To electrocute the water and destroy the sea creature, I need to ask for help of an electrician. I will need to prepare the wire and the plug.",
            -37.009885767
        ],
        [
            "To electrocute the water and destroy the sea creature, I need a power source. I have some batteries and a flashlight, which can be used as power source.",
            -29.26400682
        ],
        [
            "To electrocute the water and destroy the sea creature, I need some parts, and the parts are rubber glove, copper wire, and a battery.",
            -26.344827319999997
        ],
        [
            "To electrocute the water and destroy the sea creature, I need to create an electric circuit. I need a battery, a wire, a switch, and light bulb.",
            -23.39900582
        ],
        [
            "To electrocute the water and destroy the sea creature, I need to use an electrical wire and a powerful battery.",
            -20.0758524
        ],
        [
            "To electrocute the water and destroy the sea creature, I need a big power generator.",
            -11.33237456
        ],
        [
            "To electrocute the water and destroy the sea creature, I need a battery and a flashlight.",
            -9.45489528
        ],
        [
            "To electrocute the water and destroy the sea creature, I need to connect the wires to the battery.",
            -9.18916331
        ],
        [
            "To electrocute the water and destroy the sea creature, I need a battery.",
            -4.6656984
        ]
    ],
    "Turn the runt of the litter into an award-winning pig!": [
        [
            "To turn the runt of the litter into an award-winning pig, I need to select the right piglet, so I need to check out the piglets, and find the one that is the most healthy and energetic.",
            -47.76408701000001
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need to make it look good and feel good. I need to clean its ears, and then I need to take it for a walk.",
            -43.01923132299999
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need a lot of things, including a book, a toy, and a big empty plot of land.",
            -36.237449313
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need a lot of work. First Max needs some exercise so he can get into shape.",
            -34.35307648
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need a lot of training, and the training costs money, so I need a job.",
            -27.381474420000004
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need to build a pig pen, and then I need some pigs.",
            -20.1315175
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need to feed him to help him grow big and strong.",
            -13.29182525
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need to clean and feed him.",
            -11.592867799999999
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need a lot of items, in particular, I need to buy a book on the care and feeding of pigs, a sty, a wig for the run",
            -1.7900751
        ],
        [
            "To turn the runt of the litter into an award-winning pig, I need to do some research. I will need to get information about how to raise a pig, and I will need to do some reading about it. I",
            -0.94093275
        ]
    ],
    "Conceal something in my cake to help my friend burrow through the prison walls!": [
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need items, in particular, wire cutters, a hard-boiled egg, and a bottle of water.",
            -32.92925558449
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need to get some items. The items that I need are a cake, a candle, and something to conceal in the cake.",
            -26.380556301
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need to get a cake mix, a spoon, and a fake cake.",
            -25.56629434
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need a cake mix and a bottle of soda.",
            -15.832869
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need to know what is in the cake.",
            -12.66983895
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need to make a hollow cake.",
            -10.842506599999998
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need to use a special ingredient.",
            -9.97132663
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need something to put inside the cake.",
            -8.944364987
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need a cake mix.",
            -8.413070000000001
        ],
        [
            "To conceal something in my cake to help my friend burrow through the prison walls, I need to bake a cake.",
            -4.92901111
        ]
    ]
}
